#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
; shader debug name: 1b611c146b9a86a6dbc5796aedb2a926.pdb
; shader hash: 1b611c146b9a86a6dbc5796aedb2a926
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 2
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 2
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !36)
!1 = !DIFile(filename: "Shaders\5CBasicVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !18, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !24}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 14, size: 256, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 16, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 17, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 8, size: 224, align: 32, elements: !25)
!25 = !{!26, !35}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !24, file: !1, line: 10, baseType: !27, size: 96, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !29, templateParams: !33)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !{!13, !34}
!34 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !24, file: !1, line: 11, baseType: !4, size: 128, align: 32, offset: 96)
!36 = !{!37}
!37 = !DIGlobalVariable(name: "WorldViewProj", linkageName: "\01?WorldViewProj@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !41, templateParams: !58)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!58 = !{!13, !59, !60}
!59 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!60 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!64 = !{!"Shaders\5CBasicVS.hlsl", !"// BasicVS.hlsl - Simple vertex shader for position + color vertices\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    float4x4 WorldViewProj;\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    output.Position = mul(float4(input.Position, 1.0f), WorldViewProj);\0D\0A    output.Color = input.Color;\0D\0A    return output;\0D\0A}\0D\0A"}
!65 = !{!"Shaders\5CBasicVS.hlsl"}
!66 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"-Qembed_debug"}
!67 = !{i32 1, i32 7}
!68 = !{i32 1, i32 8}
!69 = !{!"vs", i32 6, i32 7}
!70 = !{null, null, !71, null}
!71 = !{!72}
!72 = !{i32 0, %hostlayout.Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 64, null}
!73 = !{i32 0, %hostlayout.Constants undef, !74}
!74 = !{i32 64, !75}
!75 = !{i32 6, !"WorldViewProj", i32 2, !76, i32 3, i32 0, i32 7, i32 9}
!76 = !{i32 4, i32 4, i32 2}
!77 = !{i32 1, void ()* @main, !78}
!78 = !{!79}
!79 = !{i32 0, !2, !2}
!80 = !{[10 x i32] [i32 8, i32 8, i32 15, i32 15, i32 15, i32 0, i32 16, i32 32, i32 64, i32 128]}
!81 = !{void ()* @main, !"main", !82, !70, !92}
!82 = !{!83, !89, null}
!83 = !{!84, !87}
!84 = !{i32 0, !"POSITION", i8 9, i8 0, !85, i8 0, i32 1, i8 3, i32 0, i8 0, !86}
!85 = !{i32 0}
!86 = !{i32 3, i32 7}
!87 = !{i32 1, !"COLOR", i8 9, i8 0, !85, i8 0, i32 1, i8 4, i32 1, i8 0, !88}
!88 = !{i32 3, i32 15}
!89 = !{!90, !91}
!90 = !{i32 0, !"SV_Position", i8 9, i8 3, !85, i8 4, i32 1, i8 4, i32 0, i8 0, !88}
!91 = !{i32 1, !"COLOR", i8 9, i8 0, !85, i8 2, i32 1, i8 4, i32 1, i8 0, !88}
!92 = !{i32 0, i64 1}
!93 = !DILocation(line: 20, column: 23, scope: !17)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 22, type: !20)
!95 = !DIExpression(DW_OP_bit_piece, 128, 32)
!96 = !DILocation(line: 22, column: 14, scope: !17)
!97 = !DIExpression(DW_OP_bit_piece, 160, 32)
!98 = !DIExpression(DW_OP_bit_piece, 192, 32)
!99 = !DIExpression(DW_OP_bit_piece, 224, 32)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 20, type: !24)
!101 = !DIExpression(DW_OP_bit_piece, 0, 32)
!102 = !DIExpression(DW_OP_bit_piece, 32, 32)
!103 = !DIExpression(DW_OP_bit_piece, 96, 32)
!104 = !DIExpression(DW_OP_bit_piece, 64, 32)
!105 = !DILocation(line: 23, column: 57, scope: !17)
!106 = !DILocation(line: 23, column: 23, scope: !17)
!107 = !DILocation(line: 23, column: 21, scope: !17)
!108 = !DILocation(line: 24, column: 18, scope: !17)
!109 = !DILocation(line: 25, column: 12, scope: !17)
!110 = !DILocation(line: 25, column: 5, scope: !17)

#endif

const unsigned char g_pBasicVS[] = {
  0x44, 0x58, 0x42, 0x43, 0x17, 0x38, 0x67, 0x45, 0x8a, 0x52, 0x44, 0x4c,
  0x66, 0x59, 0xb6, 0xc9, 0x65, 0x36, 0x04, 0x0e, 0x01, 0x00, 0x00, 0x00,
  0x90, 0x25, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xb4, 0x00, 0x00, 0x00, 0x18, 0x01, 0x00, 0x00,
  0x04, 0x02, 0x00, 0x00, 0x28, 0x16, 0x00, 0x00, 0xe0, 0x1c, 0x00, 0x00,
  0x14, 0x1d, 0x00, 0x00, 0x30, 0x1d, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x49, 0x53, 0x47, 0x31, 0x58, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00,
