#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
; shader debug name: 02b82c7d99b3341aea987361ca7741b7.pdb
; shader hash: 02b82c7d99b3341aea987361ca7741b7
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !60)
!1 = !DIFile(filename: "Shaders\5CCmoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 26, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 26, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !33, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !48}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 15, size: 352, align: 32, elements: !36)
!36 = !{!37, !38, !47}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !35, file: !1, line: 17, baseType: !4, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !35, file: !1, line: 18, baseType: !39, size: 96, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!13, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !35, file: !1, line: 19, baseType: !4, size: 128, align: 32, offset: 224)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 8, size: 256, align: 32, elements: !49)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !48, file: !1, line: 10, baseType: !39, size: 96, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !48, file: !1, line: 11, baseType: !39, size: 96, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !48, file: !1, line: 12, baseType: !53, size: 64, align: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 5, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 5, size: 64, align: 32, elements: !55, templateParams: !58)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !{!13, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!60 = !{!61, !85, !86}
!61 = !DIGlobalVariable(name: "WorldViewProj", linkageName: "\01?WorldViewProj@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !62, isLocal: false, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !65, templateParams: !82)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !64, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!82 = !{!13, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!84 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!85 = !DIGlobalVariable(name: "World", linkageName: "\01?World@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 4, type: !62, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "ObjectColor", linkageName: "\01?ObjectColor@Constants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 5, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!91 = !{!"Shaders\5CCmoVS.hlsl", !"cbuffer Constants : register(b0)\0D\0A{\0D\0A  float4x4 WorldViewProj;\0D\0A  float4x4 World;\0D\0A  float4   ObjectColor;\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A  float3 position : POSITION;\0D\0A  float3 normal   : NORMAL;\0D\0A  float2 texcoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A  float4 position : SV_Position;\0D\0A  float3 normal   : NORMAL;\0D\0A  float4 color    : COLOR;\0D\0A};\0D\0A\0D\0APSInput main(VSInput input)\0D\0A{\0D\0A  PSInput output;\0D\0A  output.position = mul(float4(input.position, 1.0f), WorldViewProj);\0D\0A  output.normal = normalize(mul(input.normal, (float3x3)World));\0D\0A  output.color = ObjectColor;\0D\0A  return output;\0D\0A}\0D\0A"}
!92 = !{!"Shaders\5CCmoVS.hlsl"}
!93 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"/Qembed_debug"}
!94 = !{i32 1, i32 7}
!95 = !{i32 1, i32 8}
!96 = !{!"vs", i32 6, i32 7}
!97 = !{null, null, !98, null}
!98 = !{!99}
!99 = !{i32 0, %hostlayout.Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 144, null}
!100 = !{i32 0, %hostlayout.Constants undef, !101}
!101 = !{i32 144, !102, !104, !105}
!102 = !{i32 6, !"WorldViewProj", i32 2, !103, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!103 = !{i32 4, i32 4, i32 2}
!104 = !{i32 6, !"World", i32 2, !103, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!105 = !{i32 6, !"ObjectColor", i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!106 = !{i32 1, void ()* @main, !107}
!107 = !{!108}
!108 = !{i32 0, !2, !2}
!109 = !{[12 x i32] [i32 10, i32 12, i32 15, i32 15, i32 15, i32 0, i32 112, i32 112, i32 112, i32 0, i32 0, i32 0]}
!110 = !{void ()* @main, !"main", !111, !97, !123}
!111 = !{!112, !118, null}
!112 = !{!113, !116, !117}
!113 = !{i32 0, !"POSITION", i8 9, i8 0, !114, i8 0, i32 1, i8 3, i32 0, i8 0, !115}
!114 = !{i32 0}
!115 = !{i32 3, i32 7}
!116 = !{i32 1, !"NORMAL", i8 9, i8 0, !114, i8 0, i32 1, i8 3, i32 1, i8 0, !115}
!117 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !114, i8 0, i32 1, i8 2, i32 2, i8 0, null}
!118 = !{!119, !121, !122}
!119 = !{i32 0, !"SV_Position", i8 9, i8 3, !114, i8 4, i32 1, i8 4, i32 0, i8 0, !120}
!120 = !{i32 3, i32 15}
!121 = !{i32 1, !"NORMAL", i8 9, i8 0, !114, i8 2, i32 1, i8 3, i32 1, i8 0, !115}
!122 = !{i32 2, !"COLOR", i8 9, i8 0, !114, i8 2, i32 1, i8 4, i32 2, i8 0, !120}
!123 = !{i32 0, i64 1}
!124 = !DILocation(line: 22, column: 22, scope: !32)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !32, file: !1, line: 22, type: !48)
!126 = !DIExpression(DW_OP_bit_piece, 96, 32)
!127 = !DIExpression(DW_OP_bit_piece, 128, 32)
!128 = !DIExpression(DW_OP_bit_piece, 160, 32)
!129 = !DIExpression(DW_OP_bit_piece, 0, 32)
!130 = !DIExpression(DW_OP_bit_piece, 32, 32)
!131 = !DIExpression(DW_OP_bit_piece, 64, 32)
!132 = !DILocation(line: 25, column: 55, scope: !32)
!133 = !DILocation(line: 25, column: 21, scope: !32)
!134 = !DILocation(line: 25, column: 19, scope: !32)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !32, file: !1, line: 24, type: !35)
!136 = !DILocation(line: 24, column: 11, scope: !32)
