#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   x           2     NONE   float   x   
;
; shader debug name: e6da82baece89500b0349a5db6107066.pdb
; shader hash: e6da82baece89500b0349a5db6107066
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "Shaders\5CShip3DVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 21, type: !18, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 14, size: 288, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 16, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 17, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !20, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 256)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 8, size: 224, align: 32, elements: !26)
!26 = !{!27, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !25, file: !1, line: 10, baseType: !28, size: 96, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !30, templateParams: !34)
!30 = !{!31, !32, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!13, !35}
!35 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !25, file: !1, line: 11, baseType: !4, size: 128, align: 32, offset: 96)
!37 = !{!38}
!38 = !DIGlobalVariable(name: "WorldViewProj", linkageName: "\01?WorldViewProj@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!13, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!65 = !{!"Shaders\5CShip3DVS.hlsl", !"// Ship3DVS.hlsl - Vertex shader for 3D ship rendering\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    float4x4 WorldViewProj;\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float4 Color : COLOR;\0D\0A    float Depth : TEXCOORD0;\0D\0A};\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    output.Position = mul(float4(input.Position, 1.0f), WorldViewProj);\0D\0A    output.Color = input.Color;\0D\0A    output.Depth = output.Position.z / output.Position.w;\0D\0A    return output;\0D\0A}\0D\0A"}
!66 = !{!"Shaders\5CShip3DVS.hlsl"}
!67 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"-Qembed_debug"}
!68 = !{i32 1, i32 7}
!69 = !{i32 1, i32 8}
!70 = !{!"vs", i32 6, i32 7}
!71 = !{null, null, !72, null}
!72 = !{!73}
!73 = !{i32 0, %hostlayout.Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 64, null}
!74 = !{i32 0, %hostlayout.Constants undef, !75}
!75 = !{i32 64, !76}
!76 = !{i32 6, !"WorldViewProj", i32 2, !77, i32 3, i32 0, i32 7, i32 9}
!77 = !{i32 4, i32 4, i32 2}
!78 = !{i32 1, void ()* @main, !79}
!79 = !{!80}
!80 = !{i32 0, !2, !2}
!81 = !{[10 x i32] [i32 8, i32 9, i32 271, i32 271, i32 271, i32 0, i32 16, i32 32, i32 64, i32 128]}
!82 = !{void ()* @main, !"main", !83, !71, !95}
!83 = !{!84, !90, null}
!84 = !{!85, !88}
!85 = !{i32 0, !"POSITION", i8 9, i8 0, !86, i8 0, i32 1, i8 3, i32 0, i8 0, !87}
!86 = !{i32 0}
!87 = !{i32 3, i32 7}
!88 = !{i32 1, !"COLOR", i8 9, i8 0, !86, i8 0, i32 1, i8 4, i32 1, i8 0, !89}
!89 = !{i32 3, i32 15}
!90 = !{!91, !92, !93}
!91 = !{i32 0, !"SV_Position", i8 9, i8 3, !86, i8 4, i32 1, i8 4, i32 0, i8 0, !89}
!92 = !{i32 1, !"COLOR", i8 9, i8 0, !86, i8 2, i32 1, i8 4, i32 1, i8 0, !89}
!93 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !86, i8 2, i32 1, i8 1, i32 2, i8 0, !94}
!94 = !{i32 3, i32 1}
!95 = !{i32 0, i64 1}
!96 = !DILocation(line: 21, column: 23, scope: !17)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 23, type: !20)
!98 = !DIExpression(DW_OP_bit_piece, 128, 32)
!99 = !DILocation(line: 23, column: 14, scope: !17)
!100 = !DIExpression(DW_OP_bit_piece, 160, 32)
!101 = !DIExpression(DW_OP_bit_piece, 192, 32)
!102 = !DIExpression(DW_OP_bit_piece, 224, 32)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 21, type: !25)
!104 = !DIExpression(DW_OP_bit_piece, 0, 32)
!105 = !DIExpression(DW_OP_bit_piece, 32, 32)
!106 = !DIExpression(DW_OP_bit_piece, 96, 32)
!107 = !DIExpression(DW_OP_bit_piece, 64, 32)
!108 = !DILocation(line: 24, column: 57, scope: !17)
!109 = !DILocation(line: 24, column: 23, scope: !17)
!110 = !DILocation(line: 24, column: 21, scope: !17)
!111 = !DILocation(line: 25, column: 18, scope: !17)
!112 = !DILocation(line: 26, column: 38, scope: !17)
!113 = !DILocation(line: 26, column: 18, scope: !17)
!114 = !DIExpression(DW_OP_bit_piece, 256, 32)
!115 = !DILocation(line: 27, column: 12, scope: !17)
!116 = !DILocation(line: 27, column: 5, scope: !17)

#endif

const unsigned char g_pShip3DVS[] = {
  0x44, 0x58, 0x42, 0x43, 0xb6, 0x62, 0x08, 0x35, 0x3b, 0x75, 0x43, 0xc7,
  0x42, 0x02, 0xd6, 0xc9, 0x51, 0x82, 0x9e, 0x7a, 0x01, 0x00, 0x00, 0x00,
  0x08, 0x27, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xb4, 0x00, 0x00, 0x00, 0x40, 0x01, 0x00, 0x00,
