#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
; shader debug name: 0243fd19cf2d0a519614d35b101de31d.pdb
; shader hash: 0243fd19cf2d0a519614d35b101de31d
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !45)
!1 = !DIFile(filename: "Shaders\5CSpriteVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 5, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 5, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !18, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 15, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 17, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 18, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 5, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 5, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 19, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 8, size: 288, align: 32, elements: !33)
!33 = !{!34, !43, !44}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 10, baseType: !35, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 11, baseType: !24, size: 64, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !32, file: !1, line: 12, baseType: !4, size: 128, align: 32, offset: 160)
!45 = !{!46}
!46 = !DIGlobalVariable(name: "WorldViewProj", linkageName: "\01?WorldViewProj@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!73 = !{!"Shaders\5CSpriteVS.hlsl", !"// SpriteVS.hlsl - Vertex shader for textured sprites\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    float4x4 WorldViewProj;\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A    float2 TexCoord : TEXCOORD0;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION;\0D\0A    float2 TexCoord : TEXCOORD0;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    output.Position = mul(float4(input.Position, 1.0f), WorldViewProj);\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    output.Color = input.Color;\0D\0A    return output;\0D\0A}\0D\0A"}
!74 = !{!"Shaders\5CSpriteVS.hlsl"}
!75 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"-Qembed_debug"}
!76 = !{i32 1, i32 7}
!77 = !{i32 1, i32 8}
!78 = !{!"vs", i32 6, i32 7}
!79 = !{null, null, !80, null}
!80 = !{!81}
!81 = !{i32 0, %hostlayout.Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 64, null}
!82 = !{i32 0, %hostlayout.Constants undef, !83}
!83 = !{i32 64, !84}
!84 = !{i32 6, !"WorldViewProj", i32 2, !85, i32 3, i32 0, i32 7, i32 9}
!85 = !{i32 4, i32 4, i32 2}
!86 = !{i32 1, void ()* @main, !87}
!87 = !{!88}
!88 = !{i32 0, !2, !2}
!89 = !{[14 x i32] [i32 12, i32 12, i32 15, i32 15, i32 15, i32 0, i32 16, i32 32, i32 0, i32 0, i32 256, i32 512, i32 1024, i32 2048]}
!90 = !{void ()* @main, !"main", !91, !79, !104}
!91 = !{!92, !100, null}
!92 = !{!93, !96, !98}
!93 = !{i32 0, !"POSITION", i8 9, i8 0, !94, i8 0, i32 1, i8 3, i32 0, i8 0, !95}
!94 = !{i32 0}
!95 = !{i32 3, i32 7}
!96 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !94, i8 0, i32 1, i8 2, i32 1, i8 0, !97}
!97 = !{i32 3, i32 3}
!98 = !{i32 2, !"COLOR", i8 9, i8 0, !94, i8 0, i32 1, i8 4, i32 2, i8 0, !99}
!99 = !{i32 3, i32 15}
!100 = !{!101, !102, !103}
!101 = !{i32 0, !"SV_Position", i8 9, i8 3, !94, i8 4, i32 1, i8 4, i32 0, i8 0, !99}
!102 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !94, i8 2, i32 1, i8 2, i32 1, i8 0, !97}
!103 = !{i32 2, !"COLOR", i8 9, i8 0, !94, i8 2, i32 1, i8 4, i32 2, i8 0, !99}
!104 = !{i32 0, i64 1}
!105 = !DILocation(line: 22, column: 23, scope: !17)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 24, type: !20)
!107 = !DIExpression(DW_OP_bit_piece, 192, 32)
!108 = !DILocation(line: 24, column: 14, scope: !17)
!109 = !DIExpression(DW_OP_bit_piece, 224, 32)
!110 = !DIExpression(DW_OP_bit_piece, 256, 32)
!111 = !DIExpression(DW_OP_bit_piece, 288, 32)
!112 = !DIExpression(DW_OP_bit_piece, 128, 32)
!113 = !DIExpression(DW_OP_bit_piece, 160, 32)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 22, type: !32)
!115 = !DIExpression(DW_OP_bit_piece, 0, 32)
!116 = !DIExpression(DW_OP_bit_piece, 32, 32)
!117 = !DIExpression(DW_OP_bit_piece, 96, 32)
!118 = !DIExpression(DW_OP_bit_piece, 64, 32)
!119 = !DILocation(line: 25, column: 57, scope: !17)
!120 = !DILocation(line: 25, column: 23, scope: !17)
!121 = !DILocation(line: 25, column: 21, scope: !17)
!122 = !DILocation(line: 26, column: 21, scope: !17)
!123 = !DILocation(line: 27, column: 18, scope: !17)
!124 = !DILocation(line: 28, column: 12, scope: !17)
!125 = !DILocation(line: 28, column: 5, scope: !17)

#endif

const unsigned char g_pSpriteVS[] = {
  0x44, 0x58, 0x42, 0x43, 0xdd, 0x1e, 0x57, 0xa0, 0x2f, 0x27, 0xb5, 0x43,
  0x59, 0x0b, 0xd7, 0x82, 0x49, 0xec, 0xb1, 0x14, 0x01, 0x00, 0x00, 0x00,
