#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
; shader debug name: a0877b828961e59c4a5024c92e7f18d6.pdb
; shader hash: a0877b828961e59c4a5024c92e7f18d6
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !45)
!1 = !DIFile(filename: "Shaders\5CCanvasVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !18, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 13, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 15, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !20, file: !1, line: 16, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 3, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 3, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 17, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 6, size: 288, align: 32, elements: !33)
!33 = !{!34, !43, !44}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !1, line: 8, baseType: !35, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 3, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 3, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !32, file: !1, line: 9, baseType: !24, size: 64, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !32, file: !1, line: 10, baseType: !4, size: 128, align: 32, offset: 160)
!45 = !{!46}
!46 = !DIGlobalVariable(name: "InvViewportSize", linkageName: "\01?InvViewportSize@Constants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 3, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!48 = !{i32 2, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!51 = !{!"Shaders\5CCanvasVS.hlsl", !"cbuffer Constants : register(b0)\0D\0A{\0D\0A  float2 InvViewportSize; // 1/width, 1/height\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A  float3 position : POSITION;\0D\0A  float2 texcoord : TEXCOORD;\0D\0A  float4 color    : COLOR;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A  float4 position : SV_Position;\0D\0A  float2 texcoord : TEXCOORD;\0D\0A  float4 color    : COLOR;\0D\0A};\0D\0A\0D\0APSInput main(VSInput input)\0D\0A{\0D\0A  PSInput output;\0D\0A\0D\0A  // Transform pixel coordinates to NDC (origin top-left, Y-down)\0D\0A  float x_ndc = input.position.x * InvViewportSize.x * 2.0f - 1.0f;\0D\0A  float y_ndc = 1.0f - input.position.y * InvViewportSize.y * 2.0f;\0D\0A\0D\0A  output.position = float4(x_ndc, y_ndc, 0.0f, 1.0f);\0D\0A  output.texcoord = input.texcoord;\0D\0A  output.color = input.color;\0D\0A\0D\0A  return output;\0D\0A}\0D\0A"}
!52 = !{!"Shaders\5CCanvasVS.hlsl"}
!53 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"/Qembed_debug"}
!54 = !{i32 1, i32 7}
!55 = !{i32 1, i32 8}
!56 = !{!"vs", i32 6, i32 7}
!57 = !{null, null, !58, null}
!58 = !{!59}
!59 = !{i32 0, %Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 8, null}
!60 = !{i32 0, %Constants undef, !61}
!61 = !{i32 8, !62}
!62 = !{i32 6, !"InvViewportSize", i32 3, i32 0, i32 7, i32 9}
!63 = !{i32 1, void ()* @main, !64}
!64 = !{!65}
!65 = !{i32 0, !2, !2}
!66 = !{[14 x i32] [i32 12, i32 12, i32 1, i32 2, i32 0, i32 0, i32 16, i32 32, i32 0, i32 0, i32 256, i32 512, i32 1024, i32 2048]}
!67 = !{void ()* @main, !"main", !68, !57, !80}
!68 = !{!69, !76, null}
!69 = !{!70, !73, !74}
!70 = !{i32 0, !"POSITION", i8 9, i8 0, !71, i8 0, i32 1, i8 3, i32 0, i8 0, !72}
!71 = !{i32 0}
!72 = !{i32 3, i32 3}
!73 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !71, i8 0, i32 1, i8 2, i32 1, i8 0, !72}
!74 = !{i32 2, !"COLOR", i8 9, i8 0, !71, i8 0, i32 1, i8 4, i32 2, i8 0, !75}
!75 = !{i32 3, i32 15}
!76 = !{!77, !78, !79}
!77 = !{i32 0, !"SV_Position", i8 9, i8 3, !71, i8 4, i32 1, i8 4, i32 0, i8 0, !75}
!78 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !71, i8 2, i32 1, i8 2, i32 1, i8 0, !72}
!79 = !{i32 2, !"COLOR", i8 9, i8 0, !71, i8 2, i32 1, i8 4, i32 2, i8 0, !75}
!80 = !{i32 0, i64 1}
!81 = !DILocation(line: 20, column: 22, scope: !17)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 22, type: !20)
!83 = !DIExpression(DW_OP_bit_piece, 192, 32)
!84 = !DILocation(line: 22, column: 11, scope: !17)
!85 = !DIExpression(DW_OP_bit_piece, 224, 32)
!86 = !DIExpression(DW_OP_bit_piece, 256, 32)
!87 = !DIExpression(DW_OP_bit_piece, 288, 32)
!88 = !DIExpression(DW_OP_bit_piece, 128, 32)
!89 = !DIExpression(DW_OP_bit_piece, 160, 32)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 20, type: !32)
!91 = !DIExpression(DW_OP_bit_piece, 0, 32)
!92 = !DIExpression(DW_OP_bit_piece, 96, 32)
!93 = !DIExpression(DW_OP_bit_piece, 32, 32)
!94 = !DILocation(line: 25, column: 36, scope: !17)
!95 = !DILocation(line: 25, column: 34, scope: !17)
!96 = !DILocation(line: 25, column: 54, scope: !17)
!97 = !DILocation(line: 25, column: 61, scope: !17)
!98 = !DILocation(line: 25, column: 9, scope: !17)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_ndc", scope: !17, file: !1, line: 25, type: !8)
!100 = !DIExpression()
!101 = !DILocation(line: 26, column: 43, scope: !17)
!102 = !DILocation(line: 26, column: 41, scope: !17)
