#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xyz         1     NONE   float   xyz 
;
; shader debug name: 4aabee59455917b7c07c3a94c37cf9b8.pdb
; shader hash: 4aabee59455917b7c07c3a94c37cf9b8
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 1
; SigOutputElements: 2
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 1
; SigOutputVectors[0]: 2
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !35)
!1 = !DIFile(filename: "Shaders\5CSkyBoxVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 17, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 11, size: 224, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 13, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord", scope: !20, file: !1, line: 14, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 3, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 3, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 6, size: 96, align: 32, elements: !33)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !1, line: 8, baseType: !24, size: 96, align: 32)
!35 = !{!36}
!36 = !DIGlobalVariable(name: "ViewProj", linkageName: "\01?ViewProj@Constants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !40, templateParams: !57)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !39, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!57 = !{!13, !58, !59}
!58 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!59 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!63 = !{!"Shaders\5CSkyBoxVS.hlsl", !"cbuffer Constants : register(b0)\0D\0A{\0D\0A  float4x4 ViewProj; // View-projection with translation removed\0D\0A};\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A  float3 position : POSITION;\0D\0A};\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A  float4 position : SV_Position;\0D\0A  float3 texcoord : TEXCOORD;\0D\0A};\0D\0A\0D\0APSInput main(VSInput input)\0D\0A{\0D\0A  PSInput output;\0D\0A\0D\0A  // Use vertex position as the cube map lookup direction\0D\0A  output.texcoord = input.position;\0D\0A\0D\0A  // Transform and force z == w so depth is always 1.0 (farthest)\0D\0A  float4 pos = mul(float4(input.position, 1.0f), ViewProj);\0D\0A  output.position = pos.xyww;\0D\0A\0D\0A  return output;\0D\0A}\0D\0A"}
!64 = !{!"Shaders\5CSkyBoxVS.hlsl"}
!65 = !{!"-E", !"main", !"-T", !"vs_6_7", !"/Od", !"/Zi", !"/Qembed_debug"}
!66 = !{i32 1, i32 7}
!67 = !{i32 1, i32 8}
!68 = !{!"vs", i32 6, i32 7}
!69 = !{null, null, !70, null}
!70 = !{!71}
!71 = !{i32 0, %hostlayout.Constants* undef, !"Constants", i32 0, i32 0, i32 1, i32 64, null}
!72 = !{i32 0, %hostlayout.Constants undef, !73}
!73 = !{i32 64, !74}
!74 = !{i32 6, !"ViewProj", i32 2, !75, i32 3, i32 0, i32 7, i32 9}
!75 = !{i32 4, i32 4, i32 2}
!76 = !{i32 1, void ()* @main, !77}
!77 = !{!78}
!78 = !{i32 0, !2, !2}
!79 = !{[5 x i32] [i32 3, i32 7, i32 31, i32 47, i32 79]}
!80 = !{void ()* @main, !"main", !81, !69, !90}
!81 = !{!82, !86, null}
!82 = !{!83}
!83 = !{i32 0, !"POSITION", i8 9, i8 0, !84, i8 0, i32 1, i8 3, i32 0, i8 0, !85}
!84 = !{i32 0}
!85 = !{i32 3, i32 7}
!86 = !{!87, !89}
!87 = !{i32 0, !"SV_Position", i8 9, i8 3, !84, i8 4, i32 1, i8 4, i32 0, i8 0, !88}
!88 = !{i32 3, i32 15}
!89 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !84, i8 2, i32 1, i8 3, i32 1, i8 0, !85}
!90 = !{i32 0, i64 1}
!91 = !DILocation(line: 17, column: 22, scope: !17)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 19, type: !20)
!93 = !DIExpression(DW_OP_bit_piece, 128, 32)
!94 = !DILocation(line: 19, column: 11, scope: !17)
!95 = !DIExpression(DW_OP_bit_piece, 160, 32)
!96 = !DIExpression(DW_OP_bit_piece, 192, 32)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 17, type: !32)
!98 = !DIExpression(DW_OP_bit_piece, 0, 32)
!99 = !DIExpression(DW_OP_bit_piece, 32, 32)
!100 = !DIExpression(DW_OP_bit_piece, 64, 32)
!101 = !DILocation(line: 22, column: 19, scope: !17)
!102 = !DILocation(line: 25, column: 50, scope: !17)
!103 = !DILocation(line: 25, column: 16, scope: !17)
!104 = !DILocation(line: 25, column: 10, scope: !17)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !17, file: !1, line: 25, type: !4)
!106 = !DIExpression(DW_OP_bit_piece, 96, 32)
!107 = !DILocation(line: 26, column: 21, scope: !17)
!108 = !DILocation(line: 26, column: 19, scope: !17)
!109 = !DILocation(line: 28, column: 10, scope: !17)
!110 = !DILocation(line: 28, column: 3, scope: !17)

#endif

const unsigned char g_pSkyBoxVS[] = {
  0x44, 0x58, 0x42, 0x43, 0x0e, 0x69, 0x60, 0xaa, 0x26, 0xb6, 0x3f, 0x2c,
  0x58, 0xf4, 0x75, 0x9d, 0x4a, 0xda, 0x8e, 0xdb, 0x01, 0x00, 0x00, 0x00,
  0x64, 0x23, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0x90, 0x00, 0x00, 0x00, 0xf8, 0x00, 0x00, 0x00,
  0xc0, 0x01, 0x00, 0x00, 0xb0, 0x14, 0x00, 0x00, 0x4c, 0x1b, 0x00, 0x00,
  0x80, 0x1b, 0x00, 0x00, 0x9c, 0x1b, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
